{"class_name": "Sequential", "sample_weight_mode": null, "keras_version": "1.0.5", "config": [{"class_name": "Dense", "config": {"output_dim": 320, "bias": true, "b_constraint": null, "activity_regularizer": null, "W_regularizer": null, "trainable": true, "init": "normal", "name": "dense_4", "batch_input_shape": [null, 64], "activation": "sigmoid", "b_regularizer": null, "input_dim": 64, "input_dtype": "float32", "W_constraint": null}}, {"class_name": "Dense", "config": {"output_dim": 320, "bias": true, "b_constraint": null, "activity_regularizer": null, "W_regularizer": null, "name": "dense_5", "init": "normal", "trainable": true, "activation": "sigmoid", "b_regularizer": null, "input_dim": null, "W_constraint": null}}, {"class_name": "Dense", "config": {"output_dim": 64, "bias": true, "b_constraint": null, "activity_regularizer": null, "W_regularizer": null, "name": "dense_6", "init": "normal", "trainable": true, "activation": "sigmoid", "b_regularizer": null, "input_dim": null, "W_constraint": null}}], "optimizer": {"epsilon": 1e-08, "name": "Nadam", "beta_2": 0.9990000128746033, "lr": 0.0020000000949949026, "beta_1": 0.8999999761581421, "schedule_decay": 0.004}, "loss": "MSE"}