{"keras_version": "1.0.5", "sample_weight_mode": null, "class_name": "Sequential", "optimizer": {"name": "Nadam", "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "lr": 0.0020000000949949026, "epsilon": 1e-08, "schedule_decay": 0.004}, "loss": "MSE", "config": [{"class_name": "Dense", "config": {"init": "normal", "b_constraint": null, "input_dim": 81, "trainable": true, "batch_input_shape": [null, 81], "W_regularizer": null, "b_regularizer": null, "W_constraint": null, "name": "dense_1", "activation": "sigmoid", "input_dtype": "float32", "output_dim": 648, "bias": true, "activity_regularizer": null}}, {"class_name": "Dense", "config": {"init": "normal", "b_constraint": null, "input_dim": null, "trainable": true, "b_regularizer": null, "W_regularizer": null, "W_constraint": null, "name": "dense_2", "activation": "sigmoid", "output_dim": 405, "bias": true, "activity_regularizer": null}}, {"class_name": "Dense", "config": {"init": "normal", "b_constraint": null, "input_dim": null, "trainable": true, "b_regularizer": null, "W_regularizer": null, "W_constraint": null, "name": "dense_3", "activation": "sigmoid", "output_dim": 81, "bias": true, "activity_regularizer": null}}]}