{"config": [{"class_name": "Convolution2D", "config": {"W_regularizer": null, "nb_row": 3, "name": "convolution2d_6", "input_dtype": "float32", "b_regularizer": null, "nb_col": 3, "trainable": true, "subsample": [1, 1], "bias": true, "W_constraint": null, "border_mode": "same", "activity_regularizer": null, "b_constraint": null, "activation": "linear", "batch_input_shape": [null, 1, 8, 8], "init": "glorot_uniform", "nb_filter": 40, "dim_ordering": "th"}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_4"}}, {"class_name": "Dropout", "config": {"p": 0.25, "trainable": true, "name": "dropout_4"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_5"}}, {"class_name": "Dense", "config": {"input_dim": null, "W_regularizer": null, "output_dim": 256, "name": "dense_6", "b_regularizer": null, "trainable": true, "bias": true, "W_constraint": null, "init": "normal", "activity_regularizer": null, "activation": "sigmoid", "b_constraint": null}}, {"class_name": "Dense", "config": {"input_dim": null, "W_regularizer": null, "output_dim": 64, "name": "dense_7", "b_regularizer": null, "trainable": true, "bias": true, "W_constraint": null, "init": "normal", "activity_regularizer": null, "activation": "sigmoid", "b_constraint": null}}], "sample_weight_mode": null, "loss": "MSE", "class_name": "Sequential", "keras_version": "1.0.5", "optimizer": {"lr": 0.0020000000949949026, "name": "Nadam", "beta_1": 0.8999999761581421, "epsilon": 1e-08, "beta_2": 0.9990000128746033, "schedule_decay": 0.004}}