{"optimizer": {"epsilon": 1e-08, "beta_1": 0.8999999761581421, "lr": 0.0020000000949949026, "name": "Nadam", "schedule_decay": 0.004, "beta_2": 0.9990000128746033}, "class_name": "Sequential", "keras_version": "1.0.5", "loss": "MSE", "sample_weight_mode": null, "config": [{"class_name": "Convolution2D", "config": {"batch_input_shape": [null, 1, 9, 9], "bias": true, "init": "glorot_uniform", "nb_row": 3, "W_constraint": null, "name": "convolution2d_1", "b_constraint": null, "activity_regularizer": null, "b_regularizer": null, "activation": "linear", "nb_col": 3, "trainable": true, "nb_filter": 64, "W_regularizer": null, "subsample": [1, 1], "input_dtype": "float32", "border_mode": "same", "dim_ordering": "th"}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_1", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "p": 0.25, "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"bias": true, "init": "normal", "b_regularizer": null, "name": "dense_1", "b_constraint": null, "activity_regularizer": null, "W_constraint": null, "activation": "sigmoid", "input_dim": null, "trainable": true, "W_regularizer": null, "output_dim": 324}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "p": 0.15, "trainable": true}}, {"class_name": "Dense", "config": {"bias": true, "init": "normal", "b_regularizer": null, "name": "dense_2", "b_constraint": null, "activity_regularizer": null, "W_constraint": null, "activation": "sigmoid", "input_dim": null, "trainable": true, "W_regularizer": null, "output_dim": 81}}]}