{"config": [{"class_name": "Dense", "config": {"name": "dense_76", "b_regularizer": null, "input_dtype": "float32", "init": "normal", "b_constraint": null, "W_regularizer": null, "input_dim": 36, "activation": "sigmoid", "W_constraint": null, "batch_input_shape": [null, 36], "bias": true, "activity_regularizer": null, "output_dim": 144, "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_77", "b_regularizer": null, "init": "normal", "b_constraint": null, "W_regularizer": null, "input_dim": null, "trainable": true, "W_constraint": null, "activation": "sigmoid", "bias": true, "activity_regularizer": null, "output_dim": 144}}, {"class_name": "Dense", "config": {"name": "dense_78", "b_regularizer": null, "init": "normal", "b_constraint": null, "W_regularizer": null, "input_dim": null, "trainable": true, "W_constraint": null, "activation": "sigmoid", "bias": true, "activity_regularizer": null, "output_dim": 36}}], "sample_weight_mode": null, "keras_version": "1.0.5", "optimizer": {"name": "Nadam", "epsilon": 1e-08, "beta_2": 0.9990000128746033, "schedule_decay": 0.004, "beta_1": 0.8999999761581421, "lr": 0.0020000000949949026}, "class_name": "Sequential", "loss": "MSE"}